04_OpenFoam/_Tut_02/OpenFOAM-14/XiFluid/engine2Valve2D/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentViscosity];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inletFuel
    {
        type            calculated;
        value           uniform 0;
    }

    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }

    piston
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    liner
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    cylinderHead
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    ivHead
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    ivStem
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    evHead
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    evStem
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    frontAndBack
    {
        type            empty;
    }

    "nonCouple.*"
    {
        type            calculated;
        value           uniform 0;
    }

}


// ************************************************************************* //
