04_OpenFoam/_Tut_02/OpenFOAM-14/XiFluid/engine2Valve2D/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ignition
{
    type            constantbXiIgnition;

    cellZone        ignition;

    period          720;

    start           715;
    duration        1;
    strength        1;
    combustionDuration 245;
}

correction
{
    type            bXiKernelCorr;

    cellZone        all;

    ignition        ignition;

    duration        20;

    kernelShape
    {
        type            cylindrical;
        thickness       0.05;
        cylinderFraction 1;
    }
}

viscousHeating.u
{
    type viscousHeating;
    phase u;
}

viscousHeating.b
{
    type viscousHeating;
    phase b;
}


// ************************************************************************* //
