04_OpenFoam/_Tut_02/OpenFOAM-14/XiFluid/engine2Valve2D/system/fvConstraints
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvConstraints;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeConstraint limitLowPressure(min=1e4)
#includeConstraint limitTemperature(phase=u, min=290, max=3000)
#includeConstraint limitTemperature(phase=b, min=290, max=3000)

// ************************************************************************* //
